<template>
  <div class="text-ellipsis-page">
    <w-text-ellipsis
      class="content"
      :height="100"
      :text="text"
      @click.native="click"
    ></w-text-ellipsis>
  </div>
</template>

<script>
const content = `点击我可以改变内容长度；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；这里有很多的内容，这是真的；`
export default {
  data() {
    return {
      text: content,
    }
  },
  methods: {
    click() {
      this.text = content === this.text ? content.slice(0, 20) : content
    },
  },
}
</script>

<style lang="scss" scoped>
.text-ellipsis-page {
  .content {
    width: 500px;
    cursor: pointer;
  }
}
</style>